[
  {
    "id": "1766762190912",
    "text": "Dutch nonprofit Stichting Frisse Wind.nu (SFW) has claimed 1.4 billion euros in compensation from Tata Steel’s Dutch subsidiaries—Tata Steel Nederland BV and Tata Steel IJmuiden BV—as part of a class action suit over alleged damages caused by the companies’ operations in the Velsen-Noord area in the Netherlands. The accusations levelled by SFW, which claims to acting on behalf of the residents living in the vicinity of the Tata Steel Netherlands (TSN) IJmuiden plant, include emission of hazardous substances, increased susceptibility of the local residents to various health issues, and a negative impact of the steel plant on property prices in the area.\n\nTSN, which includes Tata Steel Nederland BV and Tata Steel IJmuiden BV, is “fully prepared” to defend against the claim that has been filed in the District Court North Holland, and believes that SFW faces “considerable challenges regarding both admissibility and the merits of its case”, the parent company said in a stock exchange filing in India. Tata Steel added that while TSN is yet to receive material from SFW on which the nonprofit intends to rely in the case, it has “already identified substantial grounds for defence”.",
    "category": "Business",
    "confidence": 55.81,
    "timestamp": "2025-12-26T15:16:30.912Z",
    "isSaved": true
  },
  {
    "id": "1766762153141",
    "text": "Chinese archaeologists have uncovered a newly identified section of the Qin Straight Road, one of the most ambitious infrastructure projects ever undertaken in the ancient world. The 13-kilometre (8-mile) stretch offers fresh insight into a vast highway built more than 2,200 years ago to bind together the heartland and frontier of China’s first empire.\n\nThe discovery was announced on December 9, following a survey launched last year by the Cultural Heritage Protection and Research Institute of Yulin, in Shaanxi province in northwestern China, according to a report in the South China Morning Post. The newly found segment adds compelling physical evidence to historical accounts of the Qin Straight Road, which once ran for nearly 900 kilometres across northern China.\n\nHistorical accounts state that Qin Shi Huang, China’s first emperor, ordered the construction of the road, which was remarkably finished in just five years. Its goal was to establish a direct north-south route from Xianyang, the capital of the Qin dynasty in modern-day Shaanxi, to Jiuyuan, which is now Baotou in Inner Mongolia. This would enable the quick movement of troops and supplies to combat the Xiongnu nomads.\n\nExcavations along the newly identified stretch reveal advanced engineering techniques far ahead of their time. Archaeologists uncovered straight, continuous trench passes, reinforced slopes made of rammed earth, compacted roadbeds and valleys that had been deliberately filled to maintain a level route. The road averaged around 40 metres (130 feet) wide, broad enough to accommodate what would today resemble four lanes of traffic and in some places expanded to as much as 60 metres.",
    "category": "Sci/Tech",
    "confidence": 31.88,
    "timestamp": "2025-12-26T15:15:53.141Z",
    "isSaved": true
  },
  {
    "id": "1766762129330",
    "text": "By: Sports Desk\nDecember 26, 2025 10:58 AM IST\nclock_logo3 min read\ngoogle-preferred-btn\n\n\nPrint\nRohit Sharma fell for a golden duck while Virat Kohli scored 77 in 61 balls. (Express Photo by Rohit Jain Paras and PTI)Rohit Sharma fell for a golden duck while Virat Kohli scored 77 in 61 balls. (Express Photo by Rohit Jain Paras and PTI)\nIt is a case of hit and miss thus far for Rohit Sharma as he fell for a golden duck in his second Vijay Hazare Trophy 2025/26 match for Mumbai against Uttarakhand. Fellow India veteran Virat Kohli, meanwhile, scored a 61-ball 77 against Gujarat at the BCCI Centre of Excellence in Bengaluru.\n\nRohit had lit the ground up in Jaipur just about two days earlier, smashing 155 in 94 balls against Sikkim in front of a delighted crowd at the Sawai Mansingh Stadium. That knock, in which Mumbai were chasing, only increased anticipation for the next match and the stadium was reportedly just beginning to full up when Rohit walked out to bat. However, the stands started emptying pretty soon when he fell off the last ball of the first over to Devendra Singh Bora.\n\nKohli, who also had scored a century in his first match of the tournament for Delhi a couple of days ago, had a better outing in Bengaluru. He was looking set for a second consecutive century as he raced to 77 in 61 balls before falling to Vishal Jayswal in the 22nd over.\n\nOn Wednesday, about 3000 fans had been expected at the stadium in Jaipur for Rohit’s first Vijay Hazare Trophy match since 2018. That number, however, had been met by 8am for a 9am match. By the time the crowd settled into place, there was not an empty seat available in the house – a section of the stadium near the dressing rooms was kept empty for security reasons. There was no official attendance figure, but a consensus estimate of the total count was that it neared 20,000.",
    "category": "Sports",
    "confidence": 70.39,
    "timestamp": "2025-12-26T15:15:29.330Z",
    "isSaved": true
  },
  {
    "id": "1766762102823",
    "text": "“The Qin Straight Road is the second-largest national defence project in ancient China, following the Great Wall,” according to China Cultural Heritage News, a publication affiliated with the National Cultural Heritage Administration. The publication has described it as “the ancestor of the world’s highways.”\n\nHistorical texts\nHistorical texts vividly describe the scale of the undertaking. Ancient accounts recount how builders “filled valleys and levelled mountains” to force a straight alignment across rugged landscapes. After unifying six rival states to form China, Qin Shi Huang ordered General Meng Tian, also a key architect of the early Great Wall, to mobilise hundreds of thousands of soldiers and civilians to build the road as part of a coordinated northern defence system.",
    "category": "World",
    "confidence": 38.4,
    "timestamp": "2025-12-26T15:15:02.823Z",
    "isSaved": true
  }
]