[
  {
    "id": "1764728471018",
    "text": "CREDIT CARDS\nCredit cards emerged as a major source of customer complaints in FY2025, with grievances in this segment rising far more than in other areas of banking, according to the Annual Report of the Ombudsman Scheme 2024-25 released by the Reserve Bank of India (RBI).\n\nOverall credit card complaints surged by 20.04 per cent to 50,811 cases during the year. Private sector banks dominated this space by a wide margin, driven by their strong push into unsecured lending and the rapid expansion of their card businesses. They recorded 32,696 complaints — far higher than the 3,021 complaints received against public sector banks, the report said.\n\nOne of the key reasons behind the growing pile of grievances is the fact that private banks are far more active in the credit card market, leaving PSU banks with a relatively small share. With more cards in circulation and heavier usage, private banks naturally attract a larger number of customer issues.\n\nInterestingly, even as credit card complaints climbed, other categories showed encouraging improvement. Complaints related to ATM and debit card transactions fell sharply by 28.33 per cent to 18,082 cases in FY25. Issues tied to mobile and electronic banking declined by 12.74 per cent year-on-year. These trends indicate that digital systems are becoming more reliable, although the sheer volume of digital transactions handled by private banks continues to create pressure points.",
    "category": "Business",
    "confidence": 66.23,
    "timestamp": "2025-12-03T02:21:11.018Z",
    "isSaved": true
  },
  {
    "id": "1764728429099",
    "text": "The Lok Sabha will now function normally for the remaining days of the week, sources said. However, the Opposition INDIA bloc leaders are expected to meet at Congress president Mallikarjun Kharge’s residence on Wednesday morning to finalise their floor strategies for the coming days.\n\nAt the Speaker-convened meeting on Tuesday morning, there was a broad agreement between the two sides for a discussion on Vande Mataram followed by one on electoral reforms.\n\nSubsequently, Rijiju had a meeting with the Rajya Sabha’s floor leaders, where the Opposition insisted that the discussion on electoral reforms should precede the one on Vande Mataram, which the government did not favour.",
    "category": "World",
    "confidence": 52.26,
    "timestamp": "2025-12-03T02:20:29.099Z",
    "isSaved": true
  }
]